[
    {
        "userId": "user_12345",
        "timestamp": "2023-11-15T10:30:00.000Z",
        "messages": [
            {
                "sender": "user",
                "text": "What is quantum computing?",
                "timestamp": "2023-11-15T10:30:05.000Z"
            },
            {
                "sender": "note",
                "text": "Quantum computing is a type of computation that harnesses quantum mechanical phenomena such as superposition and entanglement to process information. Unlike classical computers that use bits (0 or 1), quantum computers use quantum bits or qubits, which can exist in a superposition of states simultaneously.",
                "timestamp": "2023-11-15T10:30:15.000Z"
            }
        ]
    },
    {
        "userId": "user_67890",
        "timestamp": "2023-11-15T14:22:00.000Z",
        "messages": [
            {
                "sender": "user",
                "text": "Tell me about Albert Einstein",
                "timestamp": "2023-11-15T14:22:05.000Z"
            },
            {
                "sender": "note",
                "text": "Albert Einstein was a German-born theoretical physicist who developed the theory of relativity, one of the two pillars of modern physics. His work is also known for its influence on the philosophy of science.",
                "timestamp": "2023-11-15T14:22:15.000Z"
            },
            {
                "sender": "user",
                "text": "What did he win the Nobel Prize for?",
                "timestamp": "2023-11-15T14:22:30.000Z"
            },
            {
                "sender": "note",
                "text": "Einstein received the 1921 Nobel Prize in Physics for his services to theoretical physics, and especially for his discovery of the law of the photoelectric effect, a pivotal step in the evolution of quantum theory.",
                "timestamp": "2023-11-15T14:22:45.000Z"
            }
        ]
    },
    {
        "userId": "user_11111",
        "timestamp": "2023-11-15T16:45:00.000Z",
        "messages": [
            {
                "sender": "user",
                "text": "How does gravity work?",
                "timestamp": "2023-11-15T16:45:05.000Z"
            },
            {
                "sender": "note",
                "text": "Gravity is a fundamental force of nature that causes objects with mass to be attracted to each other. The more massive an object, the stronger its gravitational pull. This force is described by Newton's law of universal gravitation, which states that every particle attracts every other particle in the universe with a force that is proportional to the product of their masses and inversely proportional to the square of the distance between their centers.",
                "timestamp": "2023-11-15T16:45:15.000Z"
            }
        ]
    },
    {
        "userId": "user_22222",
        "timestamp": "2023-11-15T17:30:00.000Z",
        "messages": [
            {
                "sender": "user",
                "text": "What is artificial intelligence?",
                "timestamp": "2023-11-15T17:30:05.000Z"
            },
            {
                "sender": "note",
                "text": "Artificial Intelligence (AI) refers to the simulation of human intelligence in machines that are programmed to think and learn like humans. The field was founded in 1956 and has evolved through several phases including symbolic AI, machine learning, and deep learning.",
                "timestamp": "2023-11-15T17:30:15.000Z"
            }
        ]
    }
]
