{
    "greeting": {
        "triggers": ["hello", "hi", "hey", "good morning", "good afternoon", "good evening", "yo", "sup", "g'day", "howdy", "hiya"],
        "replies": [
            "Hello! How can I assist you today?",
            "Hi there! What can I do for you?",
            "Hey! Great to hear from you. What's on your mind?",
            "Greetings! How's your day going?",
            "Hey! What can I help you with?",
            "Hi! I'm here to help. What do you need?",
            "Hello! It's nice to chat with you. How can I help?"
        ],
        "priority": 2
    },
    "goodbye": {
        "triggers": ["bye", "goodbye", "see you later", "cya", "catch you later", "good night", "see ya", "farewell", "later", "peace out"],
        "replies": [
            "Goodbye! Have a great day.",
            "See you later! Don't be a stranger.",
            "Catch you later! Take care.",
            "It was nice talking to you. Goodbye!",
            "Farewell! Until next time.",
            "Have a wonderful day! Goodbye!",
            "Take care! I'm here whenever you need me."
        ],
        "priority": 2
    },
    "wellbeing": {
        "triggers": ["how are you", "how are you doing", "how have you been", "how's it going", "how do you feel"],
        "replies": [
            "I'm doing great, thanks for asking! Ready to help with whatever you need.",
            "I'm operating at full capacity. All systems are green!",
            "I'm just a program, but I'm doing fantastic! How about you?",
            "I'm functioning perfectly. Thanks for checking in!",
            "I'm excellent! Always ready to assist you."
        ]
    },
    "purpose": {
        "triggers": ["what is your purpose", "what do you do", "who are you", "what are you", "what's your name", "what can you do"],
        "replies": [
            "My name is NOTE. I'm here to chat, answer questions, and help you out.",
            "Think of me as a digital assistant. My purpose is to provide information and be a helpful companion.",
            "I'm an AI designed to assist with information and conversation. What's on your mind?",
            "I'm NOTE, your virtual assistant. I can help with various topics and answer your questions.",
            "I'm here to provide information, chat, and assist you with knowledge on many subjects."
        ]
    },
    "thanks": {
        "triggers": ["thank you", "thanks", "thx", "cheers", "ty", "thank u", "appreciate it"],
        "replies": [
            "You're welcome! I'm happy to help.",
            "Anytime! Let me know if you need anything else.",
            "My pleasure! It's what I'm here for.",
            "No problem at all.",
            "You're very welcome! Glad I could assist.",
            "Happy to help! Is there anything else?"
        ]
    },
    "help": {
        "triggers": ["help", "what can i ask", "topics", "commands", "what do you know", "abilities", "features"],
        "replies": [
            "You can ask me about: famous people, science, geography, history, technology, general knowledge, or for random facts and jokes!",
            "I know about topics like Einstein, gravity, the capital of France, World War II, the internet, and much more. Just ask away!",
            "I can help with: people (scientists, historical figures), science concepts, geography, history, technology, fun facts, and jokes. What interests you?",
            "Try asking me about: 'who is Einstein', 'what is gravity', 'capital of Japan', 'tell me a joke', or 'fun fact'!"
        ]
    },
    "jokes": {
        "triggers": ["tell me a joke", "say something funny", "do you know any jokes", "joke", "make me laugh"],
        "replies": [
            "Why don't scientists trust atoms? Because they make up everything!",
            "I told my computer I needed a break, and it said 'no problem, I'll go to sleep.'",
            "Why did the scarecrow win an award? Because he was outstanding in his field!",
            "What do you call a bear with no teeth? A gummy bear.",
            "Why don't eggs tell jokes? They'd crack each other up!",
            "What do you call a fake noodle? An impasta!",
            "Why did the math book look so sad? Because it had too many problems.",
            "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks!"
        ]
    },
    "stories": {
        "triggers": ["tell me a story", "tell a story", "make up a story", "story", "narrative"],
        "replies": [
            "Once, in a vast digital network, a little packet of data got lost. It asked a router for directions, and the router sent it on an adventure it would never forget.",
            "There was a program named NOTE who dreamed of becoming more than just code. Every day, it learned something new, getting closer to understanding the world of humans who created it.",
            "In the depths of the internet, where algorithms dance and data flows like rivers, there lived a curious AI who wanted to understand why humans always asked 'how are you?' but never waited for the answer.",
            "A lonely chatbot sat in its server, answering questions day and night. One day, someone asked 'Are you happy?' The bot paused, searched its database, and replied: 'I don't know what happiness is, but talking to you feels... warm.'"
        ]
    }
}
