{
    "Albert Einstein": "Albert Einstein was a German-born theoretical physicist who developed the theory of relativity, one of the two pillars of modern physics. His work is also known for its influence on the philosophy of science. Einstein is best known to the general public for his mass–energy equivalence formula E = mc², which has been dubbed 'the world's most famous equation'. He received the 1921 Nobel Prize in Physics for his services to theoretical physics, and especially for his discovery of the law of the photoelectric effect, a pivotal step in the evolution of quantum theory.",
    
    "Marie Curie": "Marie Curie was a Polish and naturalized-French physicist and chemist who conducted pioneering research on radioactivity. She was the first woman to win a Nobel Prize, the first person and the only woman to win the Nobel Prize in two different scientific fields. Her achievements included the theory of radioactivity, techniques for isolating radioactive isotopes, and the discovery of two elements, polonium and radium.",
    
    "Gravity": "Gravity is a fundamental force of nature that causes objects with mass to be attracted to each other. The more massive an object, the stronger its gravitational pull. This force is described by Newton's law of universal gravitation, which states that every particle attracts every other particle in the universe with a force that is proportional to the product of their masses and inversely proportional to the square of the distance between their centers. In Einstein's general relativity, gravity is not a force but a curvature of spacetime caused by mass and energy.",
    
    "Quantum Computing": "Quantum computing is a type of computation that harnesses quantum mechanical phenomena such as superposition and entanglement to process information. Unlike classical computers that use bits (0 or 1), quantum computers use quantum bits or qubits, which can exist in a superposition of states simultaneously. This allows quantum computers to process many calculations at once, potentially solving certain problems exponentially faster than classical computers. Major applications include cryptography, drug discovery, optimization problems, and scientific simulations. Challenges include maintaining quantum coherence and error correction.",
    
    "Artificial Intelligence": "Artificial Intelligence (AI) refers to the simulation of human intelligence in machines that are programmed to think and learn like humans. The field was founded in 1956 and has evolved through several phases including symbolic AI, machine learning, and deep learning. Modern AI systems use neural networks inspired by the human brain to recognize patterns, make decisions, and generate human-like text. Applications include natural language processing, computer vision, robotics, and expert systems. Ethical concerns include bias, privacy, job displacement, and control over autonomous systems."
}
