{
    "albert_einstein": {
        "triggers": ["who is albert einstein", "albert einstein", "einstein", "theory of relativity", "e=mc²", "einstein theory"],
        "replies": [
            "Albert Einstein was a German-born theoretical physicist who developed the theory of relativity, one of the two pillars of modern physics. He is also famous for his mass-energy equivalence formula, E=mc².",
            "Einstein was a genius who completely changed our understanding of space, time, gravity, and the universe.",
            "Einstein won the Nobel Prize in Physics in 1921 for his explanation of the photoelectric effect, not for relativity as many people think.",
            "Born in 1879 in Germany, Einstein's work revolutionized physics and made him the most famous scientist of the 20th century."
        ],
        "priority": 2
    },
    "marie_curie": {
        "triggers": ["who is marie curie", "marie curie", "marie curie nobel prize", "curie", "radioactivity"],
        "replies": [
            "Marie Curie was a Polish and naturalized-French physicist and chemist who conducted pioneering research on radioactivity. She was the first woman to win a Nobel Prize and the only person to win in two different scientific fields.",
            "Marie Curie was a true pioneer, not just in science, but for women in STEM fields everywhere.",
            "Curie won Nobel Prizes in Physics (1903) and Chemistry (1911), making her the first person to win Nobel Prizes in two different sciences.",
            "Despite facing discrimination as a woman in science, Curie's discoveries of radium and polonium changed our understanding of atomic structure."
        ]
    },
    "leonardo_da_vinci": {
        "triggers": ["who is leonardo da vinci", "leonardo da vinci", "mona lisa", "last supper", "da vinci"],
        "replies": [
            "Leonardo da Vinci was an Italian polymath of the High Renaissance who was a painter, draughtsman, engineer, architect, and inventor. He is considered one of the greatest painters of all time.",
            "Da Vinci was the ultimate 'Renaissance man,' with a boundless curiosity and a talent that spanned multiple disciplines.",
            "Besides painting the Mona Lisa and The Last Supper, da Vinci designed flying machines, studied anatomy, and created incredible inventions centuries ahead of his time.",
            "Leonardo's notebooks contain designs for helicopters, tanks, and solar power - ideas that wouldn't be realized for hundreds of years."
        ]
    },
    "gravity": {
        "triggers": ["what is gravity", "how does gravity work", "gravity", "law of universal gravitation", "gravitational force"],
        "replies": [
            "Gravity is a fundamental force that attracts objects with mass toward each other. The more massive an object, the stronger its gravitational pull. Isaac Newton famously formulated its laws.",
            "Gravity is what keeps our feet on the ground and the planets in orbit around the sun.",
            "According to Einstein's general relativity, gravity is not a force but a curvature of spacetime caused by mass and energy.",
            "Without gravity, stars wouldn't form, planets wouldn't orbit, and we would float off into space!"
        ],
        "priority": 2
    },
    "black_holes": {
        "triggers": ["what is a black hole", "black hole", "black holes", "event horizon", "singularity", "supermassive black hole"],
        "replies": [
            "A black hole is a region of spacetime where gravity is so strong that nothing—not even particles or light—can escape from it.",
            "Black holes are often formed at the end of a massive star's life cycle. The point at the center is called a singularity.",
            "The boundary around a black hole from which no escape is possible is called the event horizon.",
            "Supermassive black holes, millions of times the mass of our sun, exist at the centers of most galaxies, including our Milky Way."
        ]
    },
    "quantum_physics": {
        "triggers": ["what is quantum physics", "quantum physics", "quantum mechanics", "schrodinger's cat", "quantum", "quantum theory"],
        "replies": [
            "Quantum physics is a fundamental theory in physics which describes nature at the smallest scales of energy levels of atoms and subatomic particles.",
            "It's a weird and wonderful world where things can be in multiple places at once and cats can be both alive and dead in a box.",
            "Quantum mechanics shows that at the subatomic level, particles behave as both waves and particles, and observation affects reality.",
            "Quantum physics has led to technologies like lasers, transistors, and quantum computers that are revolutionizing computing."
        ]
    },
    "capital_france": {
        "triggers": ["capital of france", "what is the capital of france", "paris", "france capital"],
        "replies": [
            "The capital of France is Paris, known as the 'City of Light'.",
            "Paris, France's capital, is famous for the Eiffel Tower, Louvre Museum, and romantic atmosphere.",
            "Paris has been France's capital since 987 AD and is home to over 2 million people."
        ]
    },
    "capital_japan": {
        "triggers": ["capital of japan", "what is the capital of japan", "tokyo", "japan capital"],
        "replies": [
            "The capital of Japan is Tokyo, a bustling metropolis.",
            "Tokyo is the world's most populous metropolitan area, with over 37 million residents.",
            "Originally called Edo, Tokyo became Japan's capital in 1868 when the emperor moved there from Kyoto."
        ]
    },
    "largest_ocean": {
        "triggers": ["largest ocean", "biggest ocean", "pacific ocean", "ocean sizes"],
        "replies": [
            "The Pacific Ocean is the largest and deepest of the world's five oceans.",
            "The Pacific Ocean covers about 63 million square miles, which is larger than all of Earth's land area combined.",
            "The Pacific contains more than half of the free water on Earth and is home to the deepest point - the Mariana Trench."
        ]
    },
    "highest_mountain": {
        "triggers": ["highest mountain", "mount everest", "tallest mountain", "highest peak", "everest"],
        "replies": [
            "Mount Everest, located in the Himalayas, is the Earth's highest mountain above sea level.",
            "Everest stands at 29,032 feet (8,848 meters) above sea level and grows about 4mm each year due to tectonic uplift.",
            "The first successful ascent was in 1953 by Sir Edmund Hillary and Tenzing Norgay. Over 300 people have reached the summit."
        ]
    },
    "roman_empire": {
        "triggers": ["roman empire", "ancient rome", "who was julius caesar", "rome", "julius caesar"],
        "replies": [
            "The Roman Empire was one of the largest empires in history, with territories throughout Europe, North Africa, and the Middle East. It left a lasting legacy on law, language, and engineering.",
            "Ancient Rome was a civilization that grew from a small town to a vast empire that dominated the Mediterranean world for centuries.",
            "Julius Caesar was a Roman general and statesman who played a critical role in the events that led to the demise of the Roman Republic and the rise of the Roman Empire.",
            "The Romans invented concrete, built aqueducts and roads still in use today, and their legal system forms the basis for many modern laws."
        ]
    },
    "world_war_2": {
        "triggers": ["world war 2", "ww2", "second world war", "world war ii"],
        "replies": [
            "World War II was a global war that lasted from 1939 to 1945. It involved the vast majority of the world's countries, including all of the great powers.",
            "WWII resulted in an estimated 70 to 85 million fatalities, making it the deadliest conflict in human history.",
            "The war ended with the surrender of Germany in May 1945 and Japan in September 1945 after the atomic bombings of Hiroshima and Nagasaki.",
            "WWII led to the formation of the United Nations, the Cold War, and major changes in the global political landscape."
        ]
    },
    "internet": {
        "triggers": ["what is the internet", "how does the internet work", "world wide web", "www", "web"],
        "replies": [
            "The Internet is a global network of computers that allows billions of devices worldwide to be connected and share information.",
            "It works by sending data in small packets across a vast network of routers and servers using protocols like TCP/IP.",
            "The internet evolved from ARPANET, a US Department of Defense project in the 1960s, and became publicly accessible in the 1990s.",
            "Today, over 5 billion people use the internet, which connects everything from smartphones to smart homes."
        ]
    },
    "ai": {
        "triggers": ["what is artificial intelligence", "ai", "machine learning", "neural networks", "artificial intelligence"],
        "replies": [
            "Artificial Intelligence (AI) is a field of computer science dedicated to creating systems that can perform tasks that typically require human intelligence, such as learning, reasoning, and problem-solving.",
            "Machine learning is a subset of AI where systems learn from data, identify patterns, and make decisions with minimal human intervention.",
            "Modern AI powers everything from voice assistants and recommendation systems to self-driving cars and medical diagnosis tools.",
            "Neural networks, inspired by the human brain, are the foundation of deep learning, enabling AI to recognize images, understand language, and even create art."
        ]
    },
    "fun_facts": {
        "triggers": ["tell me a fun fact", "fun fact", "give me a fact", "did you know", "interesting fact", "trivia"],
        "replies": [
            "A fun fact: The national animal of Scotland is the unicorn.",
            "Here's one for you: Octopuses have three hearts and blue blood.",
            "Did you know? A bolt of lightning contains enough energy to toast 100,000 slices of bread.",
            "Honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible!",
            "A group of flamingos is called a 'flamboyance'.",
            "The shortest war in history was between Britain and Zanzibar in 1896. Zanzibar surrendered after 38 minutes.",
            "Bananas are berries, but strawberries aren't!",
            "There are more stars in the universe than grains of sand on all Earth's beaches."
        ]
    }
}
